ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_usb_dev.c
            (void) Cy_SysClk_PeriphDisableDivider(obj->clock.div_type, obj->clock.div_num);
            status = Cy_SysClk_PeriphSetDivider(obj->clock.div_type, obj->clock.div_num, div_value);
            (void) Cy_SysClk_PeriphEnableDivider(obj->clock.div_type, obj->clock.div_num);
        }
    }
    else
    {
        obj->clock = *clk;
        obj->shared_clock = true;
        status = CY_SYSCLK_SUCCESS;
    }
    
    if (CY_SYSCLK_SUCCESS == status)
    {
        status = Cy_SysClk_PeriphAssignDivider(PCLK_USB_CLOCK_DEV_BRS, obj->clock.div_type, obj->clock.div_num);
    }
    
    result = (CY_SYSCLK_SUCCESS == status) ? CY_RSLT_SUCCESS : CYHAL_USB_DEV_RSLT_ERR_CLK_CFG;

    return result;
}

static cy_rslt_t cyhal_usb_dev_pin_setup(cyhal_usb_dev_t *obj, cyhal_gpio_t dp, cyhal_gpio_t dm)
{
    cy_rslt_t result = CYHAL_USB_DEV_RSLT_ERR;
    
    const cyhal_resource_pin_mapping_t *dp_map = CY_UTILS_GET_RESOURCE(dp, cyhal_pin_map_usb_usb_dp_pad);
    const cyhal_resource_pin_mapping_t *dm_map = CY_UTILS_GET_RESOURCE(dm, cyhal_pin_map_usb_usb_dm_pad);

    if((NULL != dp_map) && (NULL != dm_map) && 
       (dp_map->inst->block_num == dm_map->inst->block_num))
    {
        cyhal_resource_inst_t pin_rsc;

        obj->resource = *dp_map->inst;
        
        /* reserve DM and DP pins */
        pin_rsc = cyhal_utils_get_gpio_resource(dp);
        result = cyhal_hwmgr_reserve(&pin_rsc);
        if (CY_RSLT_SUCCESS == result)
        {
            obj->pin_dp = dp;
            pin_rsc = cyhal_utils_get_gpio_resource(dm);
            result = cyhal_hwmgr_reserve(&pin_rsc);
        }

        if (CY_RSLT_SUCCESS == result)
        {
            obj->pin_dm = dm;
            result = cyhal_connect_pin(dp_map);
        }
        
        if (CY_RSLT_SUCCESS == result)
        {
            result = cyhal_connect_pin(dm_map);
        }
    }

    return result;
}

static void cyhal_usb_dev_free_resources(cyhal_usb_dev_t *obj)
{
    /* The object set into the default state in the cyhal_usb_dev_init() */
  
    if (CYHAL_RSC_INVALID != obj->resource.type)
    {
        cyhal_hwmgr_set_unconfigured(obj->resource.type, 
                                     obj->resource.block_num, 
                                     obj->resource.channel_num);
        
        cyhal_hwmgr_free(&(obj->resource));
    }
    
    if (CYHAL_RSC_INVALID != obj->pll_resource.type)
    {
        cyhal_hwmgr_set_unconfigured(obj->pll_resource.type, 
                                     obj->pll_resource.block_num, 
                                     obj->pll_resource.channel_num);
        
        cyhal_hwmgr_free(&(obj->pll_resource));
    }
    
    if (!obj->shared_clock)
    {        
        cyhal_hwmgr_free_clock(&(obj->clock));
    }
    
    if (CYHAL_NC_PIN_VALUE != obj->pin_dp)
    {
        cyhal_utils_disconnect_and_free(obj->pin_dp);
    }
    
    if (CYHAL_NC_PIN_VALUE != obj->pin_dm)
    {
        cyhal_utils_disconnect_and_free(obj->pin_dm);
    }
}

cy_rslt_t cyhal_usb_dev_init(cyhal_usb_dev_t *obj, cyhal_gpio_t dp, cyhal_gpio_t dm, const cyhal_clock_divider_t *clk)
{    
    cy_rslt_t result;
    
    CY_ASSERT(NULL != obj);
    
    /* Reset object into the default state to handle resource free */
    obj->base = NULL;
    obj->resource.type     = CYHAL_RSC_INVALID;
    obj->pll_resource.type = CYHAL_RSC_INVALID;
    obj->shared_clock     = true;
    obj->pin_dp = CYHAL_NC_PIN_VALUE;
    obj->pin_dm = CYHAL_NC_PIN_VALUE;
    
    result = cyhal_usb_dev_pin_setup(obj, dp, dm);

    if (CY_RSLT_SUCCESS == result)
    {      
        /* Configure CLK_HF3 frequency and proper path */
        result = cyhal_usb_dev_hf_clock_setup(obj);
        
        if (CY_RSLT_SUCCESS == result)
        {
            /* Configure CLK_PERI divider */
            result = cyhal_usb_dev_peri_clock_setup(obj, clk);
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = cyhal_hwmgr_reserve(&(obj->resource));
        
        obj->base = CYHAL_USB_DEV_BASE_ADDRESSES[obj->resource.block_num];
    }

    if (CY_RSLT_SUCCESS == result)
    {
        bool configured = cyhal_hwmgr_is_configured(obj->resource.type, 
                                              obj->resource.block_num, 
                                              obj->resource.channel_num);
        
        if (configured)
        {
            /* Check driver configuration (CYHAL supports only CPU management mode) */
            if (_FLD2VAL(USBFS_USBDEV_ARB_CFG_DMA_CFG, USBFS_DEV_ARB_CFG(obj->base)) == 
                    CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU)
            {
                /* Set context to select 16-bit register access read/write API implementation */
                obj->context.useReg16 = false;
            }
            else
            {
                result = CYHAL_USB_DEV_RSLT_ERR_BAD_DRV_CFG;
            }
        }
        else
        {
            /* Configure driver */
            static cy_stc_usbfs_dev_drv_config_t default_cfg =
            {
                .mode         = CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU,
                .dmaConfig[0] = NULL,
                .dmaConfig[1] = NULL, 
                .dmaConfig[2] = NULL, 
                .dmaConfig[3] = NULL, 
                .dmaConfig[4] = NULL, 
                .dmaConfig[5] = NULL, 
                .dmaConfig[6] = NULL,
                .dmaConfig[7] = NULL, 
                .epBuffer     = NULL,
                .epBufferSize = 0U,
                .intrLevelSel = CYHAL_USB_DEV_IRQ_LVL_DEFAULT,
                .enableLpm    = false,
                .epAccess     = CY_USBFS_DEV_DRV_USE_8_BITS_DR
            };

            if (CY_USBFS_DEV_DRV_SUCCESS != Cy_USBFS_Dev_Drv_Init(obj->base, 
                                                                  &default_cfg, 
                                                                  &(obj->context)))
            {
                result = CYHAL_USB_DEV_RSLT_ERR;
            }

            if (CY_RSLT_SUCCESS == result)
            {
               result = cyhal_hwmgr_set_configured(obj->resource.type, 
                                                   obj->resource.block_num, 
                                                   obj->resource.channel_num);
            }
        }
    }
    
    if (CY_RSLT_SUCCESS == result)
    {
        uint32_t instance = obj->resource.block_num;
        uint32_t cb_num;
        
        /* Register service callbacks */
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(obj->base, CY_USB_DEV_BUS_RESET, 
                                                 cyhal_usb_dev_drv_event_cb_table[instance][CY_USB_DEV_BUS_RESET], 
                                                 &(obj->context));
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(obj->base, CY_USB_DEV_EP0_SETUP, 
                                                 cyhal_usb_dev_drv_event_cb_table[instance][CY_USB_DEV_EP0_SETUP], 
                                                 &(obj->context));
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(obj->base, CY_USB_DEV_EP0_IN, 
                                                 cyhal_usb_dev_drv_event_cb_table[instance][CY_USB_DEV_EP0_IN], 
                                                 &(obj->context));
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(obj->base, CY_USB_DEV_EP0_OUT,
                                                 cyhal_usb_dev_drv_event_cb_table[instance][CY_USB_DEV_EP0_OUT],
                                                 &(obj->context));

        /* Register sof callback (it enables sof interrupt, so disable it after registration) */
        Cy_USBFS_Dev_Drv_RegisterSofCallback(obj->base, cyhal_usb_dev_drv_sof_cb_table[instance], 
                                             &(obj->context));
        cyhal_usb_dev_sof_enable(obj, false);

        /* Register data endpoint handlers */
        for (cb_num = 0; cb_num < CYHAL_USB_DEV_EP_EVENT_NUM; cb_num++)
        {
            Cy_USBFS_Dev_Drv_RegisterEndpointCallback(obj->base, 
                                                      (cb_num + 1U), 
                                                      cyhal_usb_dev_drv_ep_cb_table[instance], 
                                                      &(obj->context));
        }
    }
    
    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_usb_dev_free_resources(obj);
    }
    
    return result;
}


void cyhal_usb_dev_free(cyhal_usb_dev_t *obj)
{
    cyhal_usb_dev_irq_enable(obj, false);
    cyhal_usb_dev_disconnect(obj);
    cyhal_usb_dev_free_resources(obj);
}


void cyhal_usb_dev_connect(cyhal_usb_dev_t *obj)
{
    Cy_USBFS_Dev_Drv_Enable(obj->base, &(obj->context));
}


void cyhal_usb_dev_disconnect(cyhal_usb_dev_t *obj)
{
    Cy_USBFS_Dev_Drv_Disable(obj->base, &(obj->context));
}


void cyhal_usb_dev_configure(cyhal_usb_dev_t *obj)
{
    Cy_USBFS_Dev_Drv_ConfigDevice(obj->base, &(obj->context));
}


void cyhal_usb_dev_unconfigure(cyhal_usb_dev_t *obj)
{
    Cy_USBFS_Dev_Drv_UnConfigureDevice(obj->base, &(obj->context));
}


void cyhal_usb_dev_sof_enable(cyhal_usb_dev_t *obj, bool enable)
{
    uint32_t mask = Cy_USBFS_Dev_Drv_GetSieInterruptMask(obj->base);
    
    if (enable)
    {
        mask |= CY_USBFS_DEV_DRV_INTR_SIE_SOF;
        Cy_USBFS_Dev_Drv_ClearSieInterrupt(obj->base, CY_USBFS_DEV_DRV_INTR_SIE_SOF);
    }
    else
    {
        mask &= ~CY_USBFS_DEV_DRV_INTR_SIE_SOF;
    }
    
